Autodesk.Revit.DB.Analysis.MassEnergyAnalyticalModel.GetReferencesToAllShadingFaces
Get References to all Faces of the MassEnergyAnalyticalModel which are of Mass Shade subcategory.
Remarks:
Called out as a separate convenience method because often it is more useful to obtain
information about non-shading faces from the zones, and only get information about shading faces
from the MassEnergyAnalyticalModel.
Returns:
Array of Reference to Faces that represent Mass Shades.
Since:
2012

Autodesk.Revit.DB.Analysis.MassEnergyAnalyticalModel.GetReferencesToAllFaces
Get References to all Faces which are meaningful for the MassEnergyAnalyticalModel.
Array of References to Faces of the MassEnergyAnalyticalModel.
Remarks:
The results are always references to Faces.
Since:
2012

Autodesk.Revit.DB.Analysis.MassEnergyAnalyticalModel.GetJoinedMassEnergyAnalyticalModelElementIds
The ElementIds of other MassEnergyAnalyticalModels that are "joined" to this one.
Remarks:
Joined MassEnergyAnalyticalModels are created off of mass instances that are joined and which both
have MassLevelData's associated.  Only MassEnergyAnalyticalModels which are joined will take each
other into account when regenerating surface subcategories for their Faces.  For example, if two
MassEnergyAnalyticalModels were adjacent but not joined, both their touching faces would be treated
as "Mass Exterior Wall", instead of "Mass Interior Wall".  This situation (touching things not being
joined) because mass instances, and as a result, corresponding MassEnergyAnalyticalModel's are
automatically joined and only become unjoined if the user unjoins them.
Returns:
ElementIds of other MassEnergyAnalyticalModels that are joined to this one.
Since:
2012

Autodesk.Revit.DB.Analysis.MassEnergyAnalyticalModel.GetValidSurfaceCategoryIdsForReference(Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.ElementId@)
The Mass surface subcategory ids that are appropriate values for the input Reference.
reference:
A Reference to a Face of this MassEnergyAnalyticalModel.
recommendedDefaultSubcategoryId:
The ElementId that is recommended as the default setting for this pick.
Returns:
Returns the ElementIds of appropriate values for input Reference.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The Reference is not a Face of this MassEnergyAnalyticalModel.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Analysis.MassEnergyAnalyticalModel.GetMassEnergyAnalyticalModelIdForMassInstance(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Get the ElementId of the MassEnergyAnalyticalModel for a mass instance.
document:
The Document.
massInstanceId:
ElementId of a mass instance.
Returns:
ElementId of a MassEnergyAnalyticalModel.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ElementId massInstanceId is not a mass instance.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Analysis.MassEnergyAnalyticalModel.GetMassSurfaceDataIdForReference(Autodesk.Revit.DB.Reference)
Get the ElementId of the MassSurfaceData corresponding to the Reference.
reference:
A Reference to a face of this MassEnergyAnalyticalModel.
Returns:
ElementId of a MassSurfaceData.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The Reference is not a Face of this MassEnergyAnalyticalModel.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Analysis.MassEnergyAnalyticalModel.GetCoincidentMassZoneFaceReferences(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Reference)
Returns References to Faces from MassZones coincident with an input Face from a
MassEnergyAnalyticalModel.
Remarks:
The results are always References to Faces. The Reference Type should report as REFERENCE_TYPE_SURFACE.
Currently Revit improperly reports it as REFERENCE_TYPE_NONE.
document:
The Document.
referenceToFace:
A Reference to a Face of a MassEnergyAnalyticalModel.
Returns:
Returns References to Faces from MassZones coincident with an input Face from a
MassEnergyAnalyticalModel.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The Reference is not a Face of a MassEnergyAnalyticalModel.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Analysis.MassEnergyAnalyticalModel.GetCoincidentEnergyAnalyticalModelFaceReference(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Reference)
Returns a Reference to a Face from the same or a different MassEnergyAnalyticalModel
that is coincident with the input Face.
Remarks:
The result is always a Reference to a Face. The Reference Type should report as REFERENCE_TYPE_SURFACE.
Currently Revit improperly reports it as REFERENCE_TYPE_NONE.
document:
The Document.
referenceToFace:
A Reference to a Face of a MassEnergyAnalyticalModel.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The Reference is not a Face of a MassEnergyAnalyticalModel.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Analysis.MassEnergyAnalyticalModel.GetMassZoneIds
Get the MassZone ElementIds that are created from this MassEnergyAnalyticalModel.
Returns:
Returns the ElementIds of MassZones.
Since:
2012

Autodesk.Revit.DB.Analysis.MassEnergyAnalyticalModel.MassId
The ElementId of the mass instance the MassEnergyAnalyticalModel is associated with.
Since:
2012

Autodesk.Revit.DB.Analysis.MassEnergyAnalyticalModel.MassZoneCoreOffset
If this value is greater than 0.0, in the MassEnergyAnalytical model a building "core" geometry
will be created for each solid geometry of the mass instance.
Remarks:
The resulting "core" geometry created inside the mass instance solid geometry
is offset inwards at each level intersecting the mass instance solid geometry by the value
of the offset.  This "core" geometry is automatically cut from its parent mass instance geometry
in the MassEnergyAnalyticalModel.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The massZoneCoreOffset is less than zero.
Since:
2012

Autodesk.Revit.DB.Analysis.MassEnergyAnalyticalModel
This class associates a mass instance with an energy analytical model data and geometry.
Remarks:
The geometry begins as a copy of its associated mass instance geometry and is modified
according to the requirements of the energy analytical model.  MassZones are created
from the MassEnergyAnalyticalModel and MassLevelDatas associated with a common mass instance.
Since:
2012